using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Yakir
{
    internal class ArraysPractice4
    {
        public static void UnitTest()
        {

        }

        public static void T1()
        {
            /*
            סעיף א

כדי לדעת איזה שחקן צבר את מספר הנקודות הגדול ביותר, סופרים לכל שחקן בנפרד את סך הנקודות שהוא קלע לאורך המשחק. לאחר סיום הקלט משווים בין הסכומים של כל השחקנים ובודקים למי מהם יש את הסכום הגבוה ביותר. השחקן עם הסכום הגבוה ביותר הוא התשובה.

סעיף ב

כדי לחשב כמה נקודות צברה הקבוצה במשך כל המשחק, מחברים את מספר הנקודות של כל הקליעות שהוזנו בקלט. בסיום הקלט הסכום שהתקבל הוא מספר הנקודות הכולל של הקבוצה.

סעיף ג

כדי למצוא מהו סוג הקליעה הנפוץ ביותר, סופרים כמה פעמים הופיעה קליעה של נקודה אחת, כמה פעמים הופיעה קליעה של שתי נקודות וכמה פעמים הופיעה קליעה של שלוש נקודות. לאחר מכן משווים בין שלושת הספירות וקובעים איזה סוג קליעה הופיע הכי הרבה פעמים.

סעיף ד

כדי לדעת איזה שחקן או שחקנים לא צברו אף נקודה במהלך המשחק, בודקים עבור כל שחקן אם סך הנקודות שלו הוא אפס. כל שחקן שעבורו סכום הנקודות הוא אפס הוא שחקן שלא קלע כלל במהלך המשחק.
            */
        }

        public static void T2()
        {
            int[] arr = new int[8];
            int[] counts = new int[2];
            int element;
            for ( int i = 0; i < arr.Length; i++)
            {
                element = arr[i];
                counts[element % 2]++;
            }
            for (int i = 0; i < counts.Length; i++)
            {
                Console.WriteLine(counts[i]);
            }
            // א. פלט : 
        }
    }
}
